#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=7532912136422543624]
local_file.k3s_ansible_host_cloud_config: Refreshing state... [id=726099b53168c8bf93aab0585c5f2776c3fd34f2]
null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner: Refreshing state... [id=3676433428233132115]
proxmox_vm_qemu.workstation-1: Refreshing state... [id=milky-polaris/qemu/123]
proxmox_vm_qemu.cloudflare-tunnel-solufit-1: Refreshing state... [id=milky-capella/qemu/2003]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-carina/qemu/2006]
proxmox_vm_qemu.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-polaris/qemu/2004]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-capella/qemu/1000]
proxmox_vm_qemu.k3s-manager-controller-01: Refreshing state... [id=milky-capella/qemu/1001]
proxmox_vm_qemu.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-carina/qemu/2005]
proxmox_vm_qemu.k3s-manager-worker-01: Refreshing state... [id=milky-polaris/qemu/1002]
proxmox_vm_qemu.gateway-1: Refreshing state... [id=milky-capella/qemu/122]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # local_file.k3s_ansible_host_cloud_config will be created
  + resource "local_file" "k3s_ansible_host_cloud_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./files/ansible-host-cloud-config.yaml"
      + id                   = (known after apply)
    }

  # null_resource.always_run must be replaced
+/- resource "null_resource" "always_run" {
      ~ id       = "7532912136422543624" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2024-11-22T15:53:38Z" -> (known after apply)
        }
    }

  # null_resource.k3s_ansible_host_cloud_config_ssh_file_provisioner will be replaced due to changes in replace_triggered_by
+/- resource "null_resource" "k3s_ansible_host_cloud_config_ssh_file_provisioner" {
      ~ id = "3676433428233132115" -> (known after apply)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-1" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/2003"
        name                   = "solufit-cloudflare-tunnel-1"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-2" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/2004"
        name                   = "solufit-cloudflare-tunnel-2"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-3" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2005"
        name                   = "solufit-cloudflare-tunnel-3"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-carina/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.gateway-1 will be destroyed
  # (because proxmox_vm_qemu.gateway-1 is not in configuration)
  - resource "proxmox_vm_qemu" "gateway-1" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 2 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.0.0.61" -> null
      - define_connection_info = true -> null
      - desc                   = "ssh-gateway" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-capella/qemu/122" -> null
      - ipconfig0              = "ip=10.0.0.61/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - ipconfig2              = "ip=10.100.0.2/24" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 2048 -> null
      - name                   = "ssh-gateway-1" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.0.0.61" -> null
      - ssh_host               = "10.0.0.61" -> null
      - ssh_port               = "22" -> null
      - ssh_private_key        = (sensitive value) -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-capella" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
        # (24 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "32G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "evnet1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "76:5E:00:1F:8D:31" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "8A:1C:06:0D:32:5D" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "k3s" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "DA:CE:F6:47:92:A1" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "9f45e3bd-e36e-4fe4-b6da-deb605913d4a" -> null
            # (6 unchanged attributes hidden)
        }
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1000"
        name                   = "k3s-ansible-host"
        tags                   = null
        # (68 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-capella/qemu/1001"
        name                   = "solufit-k3s-controller-01"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-01 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-01" {
      + bootdisk               = "scsi0"
      - ciuser                 = "ubuntu" -> null
        id                     = "milky-polaris/qemu/1002"
        name                   = "solufit-k3s-worker-01"
        tags                   = null
        # (67 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.workstation-1 will be destroyed
  # (because proxmox_vm_qemu.workstation-1 is not in configuration)
  - resource "proxmox_vm_qemu" "workstation-1" {
      - additional_wait        = 5 -> null
      - agent                  = 0 -> null
      - automatic_reboot       = true -> null
      - balloon                = 0 -> null
      - bios                   = "seabios" -> null
      - boot                   = "order=scsi0" -> null
      - ciuser                 = "ubuntu" -> null
      - clone                  = "ubuntu2204-withdocker" -> null
      - clone_wait             = 10 -> null
      - cores                  = 8 -> null
      - cpu                    = "host" -> null
      - default_ipv4_address   = "10.0.0.62" -> null
      - define_connection_info = true -> null
      - desc                   = "workstation-1" -> null
      - force_create           = false -> null
      - full_clone             = true -> null
      - hotplug                = "network,disk,usb" -> null
      - id                     = "milky-polaris/qemu/123" -> null
      - ipconfig0              = "ip=10.0.0.62/24" -> null
      - ipconfig1              = "ip=dhcp" -> null
      - kvm                    = true -> null
      - linked_vmid            = 0 -> null
      - memory                 = 16384 -> null
      - name                   = "workstation-1" -> null
      - numa                   = false -> null
      - onboot                 = false -> null
      - os_type                = "cloud-init" -> null
      - pool                   = "solufit" -> null
      - protection             = false -> null
      - qemu_os                = "other" -> null
      - reboot_required        = false -> null
      - scsihw                 = "virtio-scsi-pci" -> null
      - skip_ipv4              = false -> null
      - skip_ipv6              = false -> null
      - sockets                = 1 -> null
      - ssh_forward_ip         = "10.0.0.62" -> null
      - ssh_host               = "10.0.0.62" -> null
      - ssh_port               = "22" -> null
      - ssh_private_key        = (sensitive value) -> null
      - ssh_user               = "ubuntu" -> null
      - sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
        EOT -> null
      - tablet                 = true -> null
        tags                   = null
      - target_node            = "milky-polaris" -> null
      - unused_disk            = [] -> null
      - vcpus                  = 0 -> null
      - vm_state               = "running" -> null
        # (25 unchanged attributes hidden)

      - disks {
          - ide {
              - ide0 {
                  - cloudinit {
                      - storage = "local-lvm" -> null
                    }
                }
            }
          - scsi {
              - scsi0 {
                  - disk {
                      - backup               = true -> null
                      - discard              = false -> null
                      - emulatessd           = false -> null
                      - format               = "raw" -> null
                      - id                   = 0 -> null
                      - iops_r_burst         = 0 -> null
                      - iops_r_burst_length  = 0 -> null
                      - iops_r_concurrent    = 0 -> null
                      - iops_wr_burst        = 0 -> null
                      - iops_wr_burst_length = 0 -> null
                      - iops_wr_concurrent   = 0 -> null
                      - iothread             = false -> null
                      - linked_disk_id       = -1 -> null
                      - mbps_r_burst         = 0 -> null
                      - mbps_r_concurrent    = 0 -> null
                      - mbps_wr_burst        = 0 -> null
                      - mbps_wr_concurrent   = 0 -> null
                      - readonly             = false -> null
                      - replicate            = false -> null
                      - size                 = "64G" -> null
                      - storage              = "local-lvm" -> null
                        # (4 unchanged attributes hidden)
                    }
                }
            }
        }

      - network {
          - bridge    = "evnet1" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "06:91:51:9A:FA:61" -> null
          - model     = "virtio" -> null
          - mtu       = 1400 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }
      - network {
          - bridge    = "vmbr2" -> null
          - firewall  = false -> null
          - link_down = false -> null
          - macaddr   = "42:3D:3A:6D:2C:C0" -> null
          - model     = "virtio" -> null
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = -1 -> null
        }

      - smbios {
          - uuid         = "ca4758ab-a5c7-4dea-ab49-69816e2b8bd4" -> null
            # (6 unchanged attributes hidden)
        }
    }

Plan: 3 to add, 7 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*